Ракович_В_Ю_70189466/src/Documents/МедОсмотр/МедОсмотр.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МедОсмотр</name>
  <basedOn>Catalog.ПоказателиЗдоровья</basedOn>
  <registerRecords>AccumulationRegister.ИсторияПоказателейЗдоровья</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Врач</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОсмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсмотра</name>
    <type>
      <types>CatalogRef.ТипыМедОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кабинет</name>
    <type>
      <types>CatalogRef.КабинетыМедПункта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиЗдоровья</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Ракович_В_Ю_70189466/src/Documents/МедОсмотр/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    Движения.ИсторияПоказателейЗдоровья.Записывать = Истина;
    Движение = Движения.ИсторияПоказателейЗдоровья.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Показатель = ПоказателиЗдоровья.НайтиПоНаименованию("Рост");
    Движение.Значение = Рост;
    
    Движение = Движения.ИсторияПоказателейЗдоровья.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Показатель = ПоказателиЗдоровья.НайтиПоНаименованию("Вес");
    Движение.Значение = Вес;
    
КонецПроцедуры
